app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2017-06-09 20:21:13.589368"], ["updated_at", "2017-06-09 20:21:13.589368"]]
---
  def create
    @post = Post.create(title: params[:post][:title], description: params[:post][:description])